docs: use mermaid graphs/charts
